# CannotCopyInplaceFamily Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotCopyInplaceFamily Property
BuiltInFailures..::..FamilyFailures Class See Also
---
In-place family groups cannot be copied between in-place families of the same project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyInplaceFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyInplaceFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyInplaceFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace